app/controllers/comments_controller.rb

	def index
		@concert = Concert.find params[:concert_id]
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", 3]]

	def new
		@concert = Concert.find params[:concert_id]
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", 1]]