app/controllers/concerts_controller.rb

	def index

			@concerts_today = Concert.where(["date = ?", Date.today])
---
SELECT "concerts".* FROM "concerts" WHERE ("concerts"."date" >= '2015-08-10' AND "concerts"."date" < '2015-09-01')

	def show
			@concert = Concert.find params[:id]
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", 1]]

	def create
			@concert = Concert.new concert_params
		if @concert.save
---
INSERT INTO "concerts" ("band", "venue", "city", "price", "date", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)